"""
切片
"""
import numpy as np

# 0-9
a = np.arange(10)
print(a[1:5])  # 1-4
print(a[2:8:2])  # 2-7 每隔一个
print(a[::-1])  # 反转
"""
切片
"""
# 4行5列的二维数组
# out
# [[ 0  1  2  3  4]
#  [ 5  6  7  8  9]
#  [10 11 12 13 14]
#  [15 16 17 18 19]]
print('------------')
print('4行5列的二维数组')
print('------------')
b = np.arange(4 * 5).reshape(4, 5)
print(b)

print('------------')
print('将1-2行，2-3列提取出来')
print('------------')
# 将1-2行，2-3列提取出来
print(b[1:3, 2:4])

# 在行方向上每隔一个提取元素
print('------------')
print('在行方向上每隔一个提取元素')
print('------------')
print(b[::2, :])
# 列方向上
print('列方向上')
print(b[:, ::2])

# 行方向倒转
print('------------')
print('行方向倒转')
print('------------')
print(b[::-1, :])

'''
三维
'''
print('------------')
print('三维')
print('------------')
c = np.zeros((3, 4, 5))
print(c)
print('------------')
print('使用切片对指定地方进行赋值')
print('------------')
c[1:, 1:4, :] = 1
print(c)
c = np.zeros((3, 4, 5))
print(c)
print('------------')
print('使用切片对指定地方进行赋值')
print('------------')
c = np.zeros((3, 4, 5))
c[::2, ::2, ::2] = 1
print(c)
